import { PrismaClient } from "@prisma/client";

const prisma = new PrismaClient();

const districts = [
  "Александровский МО",
  "Андроповский МО",
  "Апанасенковский МО",
  "Арзгирский МО",
  "Благодарненский МО",
  "Будённовский МО",
  "Георгиевский МО",
  "Грачёвский МО",
  "Изобильненский МО",
  "Ипатовский МО",
  "Кировский МО",
  "Кочубеевский МО",
  "Красногвардейский МО",
  "Курский МО",
  "Левокумский МО",
  "Минераловодский МО",
  "Невинномысск (ГО)",
  "Нефтекумский МО",
  "Новоалександровский МО",
  "Новоселицкий МО",
  "Петровский МО",
  "Предгорный МО",
  "Пятигорск (ГО)",
  "Советский МО",
  "Ставрополь (ГО)",
  "Степновский МО",
  "Труновский МО",
  "Туркменский МО",
  "Шпаковский МО",
  "Кисловодск (ГО)",
  "Лермонтов (ГО)",
  "Ессентуки (ГО)",
  "Железноводск (ГО)",
];

export async function seedDistricts() {
  console.log("Seeding Districts...");
  for (const name of districts) {
    await prisma.district.upsert({
      where: { name },
      update: {},
      create: { name },
    });
  }
  console.log("Seeding Districts complete.");
}
